{"pageProps":{"post":{"attributes":{"title":"useRef","description":""},"html":"<p><a href=\"https://codesandbox.io/s/github/btholt/react-hooks-examples-v4/tree/main?file=/src/Ref.js\">Component</a></p>\n<p>Refs are useful for several things, we&#39;ll explore two of the main reasons in these examples. I want to show you the first use case: how to emulate instance variables from React.</p>\n<p>In order to understand why refs are useful, you need to understand [how closures work][closures]. In our component, when a user clicks, it sets a timeout to log both the state and the ref&#39;s number after a second. One thing to keep in mind that <strong>the state and the ref&#39;s number are always the same</strong>. They are never out of lockstep since they&#39;re updated at the same time. <em>However</em>, since we delay the logging for a second, when it alerts the new values, it will capture what the state was when we first called the timeout (since it&#39;s held on to by the closure) but it will always log the current value since that ref is on an object that React consistently gives the same object back to you. Because it&#39;s the same object and the number is a property on the object, it will always be up to date and not subject to the closure&#39;s scope.</p>\n<p>Why is this useful? It can be useful for things like holding on to <code>setInterval</code> and <code>setTimeout</code> IDs so they can be cleared later. Or any bit of statefulness that <em>could</em> change but you don&#39;t want it to cause a re-render when it does.</p>\n<p>It&#39;s also useful for referencing DOM nodes directly and we&#39;ll see that a bit later in this section.</p>\n","slug":"useref","title":"useRef","section":"Hooks in Depth","icon":"search","filePath":"/home/runner/work/complete-intro-to-react-v7/complete-intro-to-react-v7/lessons/09-hooks-in-depth/D-useref.md","nextSlug":"/complete-intro-to-react-v7/lessons/hooks-in-depth/usereducer","prevSlug":"/complete-intro-to-react-v7/lessons/hooks-in-depth/usecontext"}},"__N_SSG":true}